import re

# 边界匹配
# "^"从字符串开头开始匹配
# "$"从字符串结尾开始匹配

# 匹配字符串是否为4-10位数字
str1 = "1000000001"  # 10位数字
str2 = "10000000001"  # 11位数字

# 匹配字符串连续4-10个数字字符 匹配str1的10位数字情况正确，是期望效果
list1 = re.findall("\d{4,10}", str1)
print(list1)  # ['1000000001']

# 匹配字符串连续4-10个数字字符 匹配str2的11位数字情况错误，不是期望效果，应该是[]才是正确的
list2 = re.findall("\d{4,10}",str2)
print(list2)  # ['1000000000']

# 下边使用"^"和"$"进行匹配

# 匹配首尾是4-10位的数字 匹配str1的10位数字的情况正常，是期望效果
list3 = re.findall("^\d{4,10}$",str1)
print(list3)  # ['1000000001']

# 匹配字符串连续4-10个数字字符 匹配str2的11位数字情况正常，是期望效果
list4 = re.findall("^\d{4,10}$",str2)
print(list4)  # []
